N = int(input())


# 자릿수의 차이가 1 ?
# dp 네.. 이건
dp = [[0,0,0,0,0,0,0,0,0,0] for _ in range(101)]
dp[0] = [0,1,1,1,1,1,1,1,1,1] # 1,2,3,4,5,6,7,8,9 가 최대 자릿수들
dp[1] = [0,2,2,2,2,2,2,2,2,1]

for i in range(2,101):
    dp[i][1] = dp[i-2][1] + dp[i-1][2]
    dp[i][2] = dp[i-1][1] + dp[i-1][3]
    dp[i][3] = dp[i-1][2] + dp[i-1][4]
    dp[i][4] = dp[i-1][3] + dp[i-1][5]
    dp[i][5] = dp[i-1][4] + dp[i-1][6]
    dp[i][6] = dp[i-1][5] + dp[i-1][7]
    dp[i][7] = dp[i-1][6] + dp[i-1][8]
    dp[i][8] = dp[i-1][7] + dp[i-1][9]
    dp[i][9] = dp[i-1][8]
print(sum(dp[N-1])%1000000000)

